АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/ManagerModule.bsl
Функция ПолучитьОбъемПоХарактеристике(ХарактеристикаПоиска) Экспорт	
	Если ЗначениеЗаполнено(ХарактеристикаПоиска) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	алк_ПараметрыХарактеристик.Объем
			|ИЗ
			|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
			|ГДЕ
			|	алк_ПараметрыХарактеристик.Характеристика = &ХарактеристикаПоиска";
		
		Запрос.УстановитьПараметр("ХарактеристикаПоиска", ХарактеристикаПоиска);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			Возврат Выборка[0].Объем; 
		Иначе
			КомментарийОшибки = СтрШаблон("Для характеристики %1 не расчитан объем", Строка(ХарактеристикаПоиска)); 
			ЗаписьЖурналаРегистрации("ПолучениеОбъемаПоХарактеристике", УровеньЖурналаРегистрации.Ошибка, , ,КомментарийОшибки);
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 1;	
	КонецЕсли;
КонецФункции
